src/Client/wsdl/IsirWsCuzkService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
             xmlns:tns="http://isirws.cca.cz/" 
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
             xmlns="http://schemas.xmlsoap.org/wsdl/" 
             targetNamespace="http://isirws.cca.cz/" 
             name="IsirWsCuzkService">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://isirws.cca.cz/types/" schemaLocation="https://isir.justice.cz:8443/isir_cuzk_ws/IsirWsCuzkService?xsd=1"></xsd:import>
    </xsd:schema>
  </types>
  <message name="getIsirWsCuzkData">
    <part xmlns:ns1="http://isirws.cca.cz/types/" name="parameters" element="ns1:getIsirWsCuzkDataRequest"></part>
  </message>
  <message name="getIsirWsCuzkDataResponse">
    <part xmlns:ns2="http://isirws.cca.cz/types/" name="parameters" element="ns2:getIsirWsCuzkDataResponse"></part>
  </message>
  <portType name="IsirWsCuzkPortType">
    <operation name="getIsirWsCuzkData">
      <input message="tns:getIsirWsCuzkData"></input>
      <output message="tns:getIsirWsCuzkDataResponse"></output>
    </operation>
  </portType>
  <binding name="IsirWsCuzkPortTypeBinding" type="tns:IsirWsCuzkPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
    <operation name="getIsirWsCuzkData">
      <soap:operation soapAction=""></soap:operation>
      <input>
        <soap:body use="literal"></soap:body>
      </input>
      <output>
        <soap:body use="literal"></soap:body>
      </output>
    </operation>
  </binding>
  <service name="IsirWsCuzkService">
    <port name="IsirWsCuzkPortType" binding="tns:IsirWsCuzkPortTypeBinding">
      <!-- Odkaz na sluzbu -->
      <soap:address location="https://isir.justice.cz:8443/isir_cuzk_ws/IsirWsCuzkService"></soap:address>
    </port>
  </service>
</definitions>

