request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://isirws.cca.cz/types/">
    <soapenv:Header/>
    <soapenv:Body>
    <typ:getIsirWsCuzkDataRequest>
    <rc>%RC%</rc>
    </typ:getIsirWsCuzkDataRequest>
    </soapenv:Body>
</soapenv:Envelope>
